MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX350F256L.PIC
      <edc:SFRDef edc:_addr="0x1F80FBE8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="29" edc:access="----------------------------nnnn" edc:cname="RPD10R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD10R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD10R" edc:desc="" edc:mask="0xf" edc:name="RPD10R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBEC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="30" edc:access="----------------------------nnnn" edc:cname="RPD11R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD11R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD11R" edc:desc="" edc:mask="0xf" edc:name="RPD11R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBF0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="31" edc:access="----------------------------nnnn" edc:cname="RPD12R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD12R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD12R" edc:desc="" edc:mask="0xf" edc:name="RPD12R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FBF4" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F80FBF8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="32" edc:access="----------------------------nnnn" edc:cname="RPD14R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD14R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD14R" edc:desc="" edc:mask="0xf" edc:name="RPD14R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBFC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="33" edc:access="----------------------------nnnn" edc:cname="RPD15R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD15R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD15R" edc:desc="" edc:mask="0xf" edc:name="RPD15R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FC00" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F80FC0C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="34" edc:access="----------------------------nnnn" edc:cname="RPE3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPE3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE3R" edc:desc="" edc:mask="0xf" edc:name="RPE3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FC10" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F80FC14" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="35" edc:access="----------------------------nnnn" edc:cname="RPE5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPE5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE5R" edc:desc="" edc:mask="0xf" edc:name="RPE5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FC18" edc:offset="8"/>
      <edc:SFRDef edc:_addr="0x1F80FC20" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="36" edc:access="----------------------------nnnn" edc:cname="RPE8R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPE8R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE8R" edc:desc="" edc:mask="0xf" edc:name="RPE8R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC24" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="37" edc:access="----------------------------nnnn" edc:cname="RPE9R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPE9R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE9R" edc:desc="" edc:mask="0xf" edc:name="RPE9R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FC28" edc:offset="24"/>
      <edc:SFRDef edc:_addr="0x1F80FC40" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="38" edc:access="----------------------------nnnn" edc:cname="RPF0R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPF0R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF0R" edc:desc="" edc:mask="0xf" edc:name="RPF0R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC44" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="39" edc:access="----------------------------nnnn" edc:cname="RPF1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPF1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF1R" edc:desc="" edc:mask="0xf" edc:name="RPF1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC48" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="40" edc:access="----------------------------nnnn" edc:cname="RPF2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPF2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF2R" edc:desc="" edc:mask="0xf" edc:name="RPF2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC4C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="41" edc:access="----------------------------nnnn" edc:cname="RPF3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPF3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF3R" edc:desc="" edc:mask="0xf" edc:name="RPF3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC50" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="42" edc:access="----------------------------nnnn" edc:cname="RPF4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPF4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF4R" edc:desc="" edc:mask="0xf" edc:name="RPF4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC54" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="43" edc:access="----------------------------nnnn" edc:cname="RPF5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPF5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF5R" edc:desc="" edc:mask="0xf" edc:name="RPF5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
